import 'package:flutter/material.dart';

void main () {
    final Map object = {
    1:23,
    31: 32,
    32: 33,
    2: {
    16: 'виноват',
        3: {
            17: 'пипец',
            4: {
                18: 'пипец',
                5:{
                    19: 'пипец',
                    6: {
                        20: 'пипец',
                        7: {
                            21: 'пипец',
                            8: {
                                22: 'пипец',
                                9: {
                                    23: 'пипец',
                                    10: {
                                        24: 'пипец',
                                        11: {
                                            25: 'пипец',
                                            12: {
                                                26: 'пипец',
                                                13: {
                                                    27: 'пипец',
                                                    14: {
                                                        28: 'пипец',
                                                        15: {
                                                            29: 'пипец',
                                                            30: 'ww'
                                                        }
                                                    }
                                                }
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    }
};

// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[1]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[31]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[32]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][16]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][17]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][18]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][19]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][20]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][21]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][22]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][23]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][24]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][25]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][26]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13][27]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13][14]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13][14][28]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13][15]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13][14][15][29]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13][14][15][30]}');




final List massive = [
    ['2', 23, 'huy', 54, '256', 20.1],
    'kruta',
    ['pizdes', 23, 30, 'tuta', 'zdesi'],
    25,
    [1, 2, 3, 4, 5, 6],
];

// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[0][0]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[0][1]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[0][2]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[0][3]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[0][4]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[0][5]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[1]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[2][0]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[2][1]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[2][2]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[2][3]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[3]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[4][0]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[4][1]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[4][2]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[4][3]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[4][4]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[4][5]}');



}
 


 void two () {
    runApp(MyApp());
 }
class MyApp extends StatelessWidget {
    @override
    Widget build(BuildContext context) {
        return MaterialApp(
            home: ListView.builder(
                itemBuilder: (BuildContext context, int index) {
                    return Text('Моя семья : }');
                }
                ),
        );
    }
   
}

void tree () {
    runApp(YourApp());
}

class YourApp extends StatelessWidget {
    @override
    Widget build(BuildContext context) {
        return MaterialApp(
            home: ListView.builder(
                itemBuilder: (BuildContext context, int index) {
                    return Text('Моя семья : }');
                }
                ),
        );
    }
}

void four () {
    runApp(HisApp());
}

class HisApp extends StatelessWidget {
    @override
    Widget build(BuildContext context) {
        return MaterialApp(
            home: GridView.builder(
                gridDelegate: SliverGridDelegateWithFixedCrossAxisCount(crossAxisCount: 2),
                itemBuilder: (BuildContext context,int index) {
                     return Text('Моя семья : }');
                }
            ),
        );
    }
}

class Class1 {
    List<int> familyAge = [
        38,
        38,
        68,
        16,
        9,
        30,
        15
    ];
}

class Class2 {
    List family = [
        'Данил',
        'Елена',
        'Виктор',
        'Светлана',
        'Ева',
        'Ира',
        'Ангелина',
    ];
}

class Class3 {
    List familygame = [
        'карты',
        'компьютерные игры',
        'настолки',
        'Танцы',
    ];
}

class Class4 {
    List familyrooms = [
        'родительская комната',
        'Моя комната',
        'Евина комната',
        'Бабушкина комната',
        'Трон',

        ];
}

class Class5 {
    List familyjobs = [
        'Мамина - мастер маникюра',
        'Папа - главный менеджер по продажам',
        'У меня - программирование, школа',
        'Евина - школа',
        'Ангелинина - учеба',
    ];
}


class Class6 {
    List familymobi = [
        'Redmi note 12 ',
        'Iphone 13 pro',
        'Redmi 8',
        'Iphone 11 pro',
        'Redmi 8',
        'Iphone 11',
        'Redmi 13 pro',
    ];
}


class Class7 {
    List<double> classroom = [
        23.4,
        23324.3
    ];
}  


class Class8 {
    Map yesofcourse = {
        'kokojambo': 'ya ya ye'
    };
}