import 'package:flutter/material.dart';

void main () {
    final Map object = {
    1:23,
    2: {
    16: 'виноват',
        3: {
            17: 'пипец',
            4: {
                18: 'пипец',
                5:{
                    19: 'пипец',
                    6: {
                        20: 'пипец',
                        7: {
                            21: 'пипец',
                            8: {
                                22: 'пипец',
                                9: {
                                    23: 'пипец',
                                    10: {
                                        24: 'пипец',
                                        11: {
                                            25: 'пипец',
                                            12: {
                                                26: 'пипец',
                                                13: {
                                                    27: 'пипец',
                                                    14: {
                                                        28: 'пипец',
                                                        15: {
                                                            29: 'пипец',
                                                            30: 'ww'
                                                        }
                                                    }
                                                }
                                            }
                                        }
                                    }
                                }
                            }
                        }
                    }
                }
            }
        }
    }
};
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[1]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][16]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][17]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][18]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][19]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][20]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][21]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][22]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][23]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][24]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][25]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][26]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13][27]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13][14]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13][14][28]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13][15]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13][14][15][29]}');
// print('Я Даня так и не запомнил как вызывать переменные в тексте -${object[2][3][4][5][6][7][8][9][10][11][12][13][14][15][30]}');




final List massive = [
    ['2', 23, 'huy', 54, '256', 20.1],
    'kruta',
    ['pizdes', 23, 30, 'tuta', 'zdesi'],
    25,
    [1, 2, 3, 4, 5, 6],
];

// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[0][0]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[0][1]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[0][2]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[0][3]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[0][4]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[0][5]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[1]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[2][0]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[2][1]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[2][2]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[2][3]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[3]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[4][0]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[4][1]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[4][2]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[4][3]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[4][4]}');
// print('Я Даня и я обещаю всегда правильно выводить данные ${massive[4][5]}');



}
 


 void two () {
    runApp(MyApp());
 }
class MyApp extends StatelessWidget {
    @override
    Widget build(BuildContext context) {
        return MaterialApp(
            home: ListView.builder(
                itemBuilder: (BuildContext context, int index) {
                    return Text('Моя семья : }');
                }
                ),
        );
    }
   
}

void tree () {
    runApp(YourApp());
}

class YourApp extends StatelessWidget {
    @override
    Widget build(BuildContext context) {
        return MaterialApp(
            home: ListView.builder(
                itemBuilder: (BuildContext context, int index) {
                    return Text('Моя семья : }');
                }
                ),
        );
    }
}

void four () {
    runApp(HisApp());
}

class HisApp extends StatelessWidget {
    @override
    Widget build(BuildContext context) {
        return MaterialApp(
            home: GridView.builder(
                gridDelegate: SliverGridDelegateWithFixedCrossAxisCount(crossAxisCount: 2),
                itemBuilder: (BuildContext context,int index) {
                     return Text('Моя семья : }');
                }
            ),
        );
    }
}


